<template>
  <main class="notePage">
    <NotePrimary
      v-for="(note, index) of notes"
      :noteData="note"
      :key="index"
    />
  </main>
</template>

<script>
import NotePrimary from './NotePrimary.vue';

export default {
  name: 'NotePage',
  components: {
    NotePrimary,
  },
  data() {
    return {
      notes: [
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
        {
          title: 'Заголовок',
          content: 'Не следует, однако, забывать, что базовый вектор развития предопределяет высокую востребованность позиций, занимаемых участниками в отношении поставленных задач. Вот вам яркий пример современных тенденций — повышение уровня гражданского сознания требует анализа переосмысления внешнеэкономических политик.', 
        },
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
        {
          title: 'Заголовок',
          content: 'Не следует, однако, забывать, что базовый вектор развития предопределяет высокую востребованность позиций, занимаемых участниками в отношении поставленных задач. Вот вам яркий пример современных тенденций — повышение уровня гражданского сознания требует анализа переосмысления внешнеэкономических политик.', 
        },
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
        {
          title: 'Заголовок',
          content: 'Не следует, однако, забывать, что базовый вектор развития предопределяет высокую востребованность позиций, занимаемых участниками в отношении поставленных задач. Вот вам яркий пример современных тенденций — повышение уровня гражданского сознания требует анализа переосмысления внешнеэкономических политик.', 
        },
        {
          title: 'Заголовок',
          content: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.', 
        },
      ],
    }
  }
}
</script>

<style scoped>
.notePage {
  height: 100vh;
  display: grid;
  grid-template-columns: 1fr;
  gap: 20px;
  padding-top: 20px;
}

@media screen and (min-width: 768px) {
	.notePage {
		padding-top: 40px;
	}
}

@media screen and (min-width: 1100px) {
	.notePage {
		grid-template-columns: 1fr 1fr 1fr;
    gap: 40px;
    grid-auto-rows: min-content;
	}
}
</style>
  